; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v7 ?v3)
             (pred_11 ?v4 ?v10)
             (pred_4 ?v7 ?v10)
             (pred_10 ?v9 ?v7 )
	     (pred_5 ?v7)
             (pred_3 ?v1)
             (pred_6 ?v4)
             (pred_12 ?v10)
             (pred_8 ?v7)
             (pred_2 ?v4)
             (pred_9 ?v7)
             (pred_1 ))



(:action op_5
:parameters (?v11 ?v6 ?v5 ?v13)
:precondition (and (pred_3 ?v11) (pred_3 ?v6) (pred_6 ?v5) (pred_12 ?v13)
          (pred_7 ?v11 ?v6) (pred_11 ?v5 ?v13)
                   (pred_4 ?v6 ?v13) (pred_5 ?v11) 
                   (pred_8 ?v6) (pred_2 ?v5))
:effect (and  (pred_9 ?v6) (not (pred_8 ?v6))))


(:action op_2
:parameters (?v11 ?v12)
:precondition (and (pred_3 ?v11) (pred_3 ?v12)
               (pred_5 ?v11) (pred_7 ?v11 ?v12) (pred_9 ?v12))
:effect (and (pred_5 ?v12) (not (pred_5 ?v11))))

(:action op_4
:parameters (?v11 ?v5)
:precondition (and (pred_3 ?v11) (pred_6 ?v5) 
                  (pred_5 ?v11) (pred_10 ?v5 ?v11) (pred_1 ))
:effect (and (pred_2 ?v5)
   (not (pred_10 ?v5 ?v11)) (not (pred_1 ))))


(:action op_1
:parameters (?v11 ?v2 ?v8)
:precondition (and (pred_3 ?v11) (pred_6 ?v2) (pred_6 ?v8)
                  (pred_5 ?v11) (pred_2 ?v8) (pred_10 ?v2 ?v11))
:effect (and (pred_2 ?v2) (pred_10 ?v8 ?v11)
        (not (pred_2 ?v8)) (not (pred_10 ?v2 ?v11))))

(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_3 ?v11) (pred_6 ?v5) 
                  (pred_5 ?v11) (pred_2 ?v5))
:effect (and (pred_1 ) (pred_10 ?v5 ?v11) (not (pred_2 ?v5)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_27 obj_02 obj_31 obj_23 obj_04 obj_01 obj_03 obj_08 obj_17 obj_05 obj_13 obj_30 obj_21 obj_12 obj_28 obj_26 obj_11 obj_25 obj_07 obj_19 obj_29 obj_15 obj_16 obj_22 obj_24
    obj_14 obj_09 obj_20
    obj_10 obj_18 obj_06 obj_32
    )

    (:init
       (pred_1)

       (pred_3 obj_27)
       (pred_3 obj_02)
       (pred_3 obj_31)
       (pred_3 obj_23)
       (pred_3 obj_04)
       (pred_3 obj_01)
       (pred_3 obj_03)
       (pred_3 obj_08)
       (pred_3 obj_17)
       (pred_3 obj_05)
       (pred_3 obj_13)
       (pred_3 obj_30)
       (pred_3 obj_21)
       (pred_3 obj_12)
       (pred_3 obj_28)
       (pred_3 obj_26)
       (pred_3 obj_11)
       (pred_3 obj_25)
       (pred_3 obj_07)
       (pred_3 obj_19)
       (pred_3 obj_29)
       (pred_3 obj_15)
       (pred_3 obj_16)
       (pred_3 obj_22)
       (pred_3 obj_24)
       (pred_12 obj_14)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_6 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_06)
       (pred_6 obj_32)

       (pred_7 obj_27 obj_01)
       (pred_7 obj_27 obj_02)
       (pred_7 obj_02 obj_03)
       (pred_7 obj_02 obj_31)
       (pred_7 obj_02 obj_27)
       (pred_7 obj_31 obj_08)
       (pred_7 obj_31 obj_23)
       (pred_7 obj_31 obj_02)
       (pred_7 obj_23 obj_17)
       (pred_7 obj_23 obj_04)
       (pred_7 obj_23 obj_31)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_04 obj_23)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_01 obj_27)
       (pred_7 obj_03 obj_30)
       (pred_7 obj_03 obj_08)
       (pred_7 obj_03 obj_02)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_08 obj_21)
       (pred_7 obj_08 obj_17)
       (pred_7 obj_08 obj_31)
       (pred_7 obj_08 obj_03)
       (pred_7 obj_17 obj_12)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_17 obj_23)
       (pred_7 obj_17 obj_08)
       (pred_7 obj_05 obj_28)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_13 obj_26)
       (pred_7 obj_13 obj_30)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_30 obj_11)
       (pred_7 obj_30 obj_21)
       (pred_7 obj_30 obj_03)
       (pred_7 obj_30 obj_13)
       (pred_7 obj_21 obj_25)
       (pred_7 obj_21 obj_12)
       (pred_7 obj_21 obj_08)
       (pred_7 obj_21 obj_30)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_12 obj_28)
       (pred_7 obj_12 obj_17)
       (pred_7 obj_12 obj_21)
       (pred_7 obj_28 obj_19)
       (pred_7 obj_28 obj_05)
       (pred_7 obj_28 obj_12)
       (pred_7 obj_26 obj_29)
       (pred_7 obj_26 obj_11)
       (pred_7 obj_26 obj_13)
       (pred_7 obj_11 obj_15)
       (pred_7 obj_11 obj_25)
       (pred_7 obj_11 obj_30)
       (pred_7 obj_11 obj_26)
       (pred_7 obj_25 obj_16)
       (pred_7 obj_25 obj_07)
       (pred_7 obj_25 obj_21)
       (pred_7 obj_25 obj_11)
       (pred_7 obj_07 obj_22)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_07 obj_12)
       (pred_7 obj_07 obj_25)
       (pred_7 obj_19 obj_24)
       (pred_7 obj_19 obj_28)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_29 obj_15)
       (pred_7 obj_29 obj_26)
       (pred_7 obj_15 obj_16)
       (pred_7 obj_15 obj_11)
       (pred_7 obj_15 obj_29)
       (pred_7 obj_16 obj_22)
       (pred_7 obj_16 obj_25)
       (pred_7 obj_16 obj_15)
       (pred_7 obj_22 obj_24)
       (pred_7 obj_22 obj_07)
       (pred_7 obj_22 obj_16)
       (pred_7 obj_24 obj_19)
       (pred_7 obj_24 obj_22)
       (pred_8 obj_01)
       (pred_8 obj_16)
       (pred_8 obj_27)
       (pred_8 obj_21)
       (pred_4  obj_01 obj_14)
       (pred_4  obj_16 obj_09)
       (pred_4  obj_27 obj_20)
       (pred_4  obj_21 obj_20)
       (pred_9 obj_02)
       (pred_9 obj_31)
       (pred_9 obj_23)
       (pred_9 obj_04)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_9 obj_17)
       (pred_9 obj_05)
       (pred_9 obj_13)
       (pred_9 obj_30)
       (pred_9 obj_12)
       (pred_9 obj_28)
       (pred_9 obj_26)
       (pred_9 obj_11)
       (pred_9 obj_25)
       (pred_9 obj_07)
       (pred_9 obj_19)
       (pred_9 obj_29)
       (pred_9 obj_15)
       (pred_9 obj_22)
       (pred_9 obj_24)

       (pred_11  obj_10 obj_14)
       (pred_11  obj_18 obj_09)
       (pred_11  obj_06 obj_20)
       (pred_11  obj_32 obj_14)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_18 obj_28)
       (pred_10 obj_06 obj_25)
       (pred_10 obj_32 obj_30)
       (pred_5 obj_19)
    )

    (:goal (and
       (pred_10 obj_10 obj_11)
    ))
(:constraints
  (always (not (pred_5 obj_07)))
)
)

; plan
1. (op_2 obj_19 obj_28)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_28)
   goals met: 0 of 1
2. (op_2 obj_28 obj_12)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_12)
   goals met: 0 of 1
3. (op_4 obj_12 obj_10)
   deleted: (pred_10 obj_10 obj_12) (pred_1)
   added: (pred_2 obj_10)
   goals met: 0 of 1
4. (op_2 obj_12 obj_17)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_17)
   goals met: 0 of 1
5. (op_2 obj_17 obj_08)
   deleted: (pred_5 obj_17)
   added: (pred_5 obj_08)
   goals met: 0 of 1
6. (op_2 obj_08 obj_03)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_03)
   goals met: 0 of 1
7. (op_2 obj_03 obj_30)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_30)
   goals met: 0 of 1
8. (op_2 obj_30 obj_11)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_11)
   goals met: 0 of 1
9. (op_3 obj_11 obj_10)
   deleted: (pred_2 obj_10)
   added: (pred_1) (pred_10 obj_10 obj_11)
   goals met: 1 of 1
